CodeIgniter 4/sipbs/app/Controllers/Home.php

SELECT *
FROM `tbl_navbar`
WHERE `navbar_parent_id` = 0
SELECT *
FROM `tbl_navbar`
WHERE `navbar_parent_id` = '1'
---
    public function index()
    {
        $db = \Config\Database::connect();

        $query = $db->table('tbl_navbar')
            ->where('navbar_parent_id', 0)
            ->get();
        $navbar_items = $query->getResult();

        foreach ($navbar_items as $item) {
            $sub_query = $db->table('tbl_navbar')
                ->where('navbar_parent_id', $item->navbar_id)
                ->get();

SELECT *
FROM `tbl_home`
 LIMIT 1
---
        $data['popular_post'] = $this->homeModel->getPopularPost();

        $this->db = \Config\Database::connect();
        $home = $this->db->table('tbl_home')->limit(1)->get()->getRow();

SELECT *
FROM `tbl_testimonial`
SELECT *
FROM `tbl_site`
 LIMIT 1
---
        $data['bg_testimoni'] = $home->home_bg_testimonial;


        $data['testimonial'] = $this->db->table('tbl_testimonial')->get();

        $db = \Config\Database::connect();
        $siteInfo = $db->table('tbl_site')->get(1)->getRow();