CodeIgniter 4/sipbs/app/Controllers/Login.php

SELECT *
FROM `tbl_site`
---
	public function index()
	{
		$db = \Config\Database::connect();

		$siteInfo = $db->table('tbl_site')->get()->getRow();