CodeIgniter 4/sipbs/app/Controllers/Backend/Comment.php

	public function index()
	{
		$data['data'] = $this->commentModel->getAllComment($this->request->getVar('page') ?? 0, 10);
		$data['total_rows'] = $this->commentModel->countAllResults();
		$data['total_unpublish'] = $this->commentModel->where('comment_status', '0')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_comment`
SELECT COUNT(*) AS `numrows`
FROM `tbl_comment`
WHERE `comment_status` = '0'