CodeIgniter 4/sipbs/app/Controllers/Backend/Inbox.php

SELECT COUNT(*) AS `numrows` FROM `tbl_inbox`
---
	public function index()
	{
		$count = $this->inboxModel->countAll();