CodeIgniter 4/sipbs/app/Views/Backend/v_comment.php

                                                            <div class="pull-left m-r-md">
                                                                <?php
                                                                $user_id = session()->get('id');
                                                                $query = $db->table('tbl_user')->where('user_id', $user_id)->get();
---
SELECT *
FROM `tbl_user`
WHERE `user_id` = '3'