CodeIgniter 4/sipbs/app/Views/Backend/v_system.php

SELECT *
FROM `tbl_user`
WHERE `user_id` = '3'
---
                                    <?php
                                    $user_id = session()->get('id');
                                    $db = \Config\Database::connect();
                                    $query = $db->table('tbl_user')->where('user_id', $user_id)->get();

SELECT *
FROM `tbl_user`
WHERE `user_id` = '3'
---
                        <?php
                        $user_id = session()->get('id');
                        $db = \Config\Database::connect();
                        $query = $db->table('tbl_user')->where('user_id', $user_id)->get();