CodeIgniter 4/sipbs/app/Models/HomeModel.php

	public function getPostHeader()
	{
		return $this->db->table('tbl_post')
			->select('tbl_post.*, user_name')
			->join('tbl_user', 'post_user_id = user_id', 'left')
			->orderBy('post_id', 'DESC')
			->limit(1)
			->get();
---
SELECT `tbl_post`.*, `user_name`
FROM `tbl_post`
LEFT JOIN `tbl_user` ON `post_user_id` = `user_id`
ORDER BY `post_id` DESC
 LIMIT 1

	public function getPostHeader2()
	{
		return $this->db->table('tbl_post')
			->select('tbl_post.*, user_name')
			->join('tbl_user', 'post_user_id = user_id', 'left')
			->orderBy('post_id', 'DESC')
			->limit(2, 1)
			->get();
---
SELECT `tbl_post`.*, `user_name`
FROM `tbl_post`
LEFT JOIN `tbl_user` ON `post_user_id` = `user_id`
ORDER BY `post_id` DESC
 LIMIT 1, 2

	public function getPostHeader3()
	{
		return $this->db->table('tbl_post')
			->select('tbl_post.*, user_name')
			->join('tbl_user', 'post_user_id = user_id', 'left')
			->orderBy('post_id', 'DESC')
			->limit(3, 3)
			->get();
---
SELECT `tbl_post`.*, `user_name`
FROM `tbl_post`
LEFT JOIN `tbl_user` ON `post_user_id` = `user_id`
ORDER BY `post_id` DESC
 LIMIT 3, 3

	public function getLatestPost()
	{
		return $this->db->table('tbl_post')
			->select('tbl_post.*, user_name, user_photo')
			->join('tbl_user', 'post_user_id = user_id', 'left')
			->orderBy('post_id', 'DESC')
			->limit(6)
			->get();
---
SELECT `tbl_post`.*, `user_name`, `user_photo`
FROM `tbl_post`
LEFT JOIN `tbl_user` ON `post_user_id` = `user_id`
ORDER BY `post_id` DESC
 LIMIT 6

	public function getPopularPost()
	{
		return $this->db->table('tbl_post')
			->select('tbl_post.*, user_name')
			->join('tbl_user', 'post_user_id = user_id', 'left')
			->orderBy('post_views', 'DESC')
			->limit(5)
			->get();
---
SELECT `tbl_post`.*, `user_name`
FROM `tbl_post`
LEFT JOIN `tbl_user` ON `post_user_id` = `user_id`
ORDER BY `post_views` DESC
 LIMIT 5