CodeIgniter 4/sipbs/app/Models/SiteModel.php

	public function getSiteData()
	{
		return $this->db->table($this->table)
			->get()
			->getRowArray();
---
SELECT *
FROM `tbl_site`