CodeIgniter 4/sipbs/app/Models/Backend/CategoryModel.php

	public function getAllCategory()
	{
		return $this->findAll();
---
SELECT *
FROM `tbl_category`