CodeIgniter 4/sipbs/app/Models/Backend/InboxModel.php

	public function getAllInbox($offset, $limit)
	{
		return $this->findAll($limit, $offset);
---
SELECT *
FROM `tbl_inbox`
 LIMIT 1, 10