CodeIgniter 4/sipbs/app/Models/Backend/TagModel.php

	public function getAllTag()
	{
		return $this->findAll();
---
SELECT *
FROM `tbl_tags`