CodeIgniter 4/sipbs/app/Models/Backend/VisitorModel.php

    public function countAllVisitors()
    {
        return $this->db->table('tbl_visitors')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_visitors`

    public function countAllPageViews()
    {
        return $this->db->table('tbl_post_views')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_post_views`

    public function countAllPosts()
    {
        return $this->db->table('tbl_post')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_post`

    public function countAllComments()
    {
        return $this->db->table('tbl_comment')->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `tbl_comment`