CodeIgniter 4/sipbs/app/Views/Header.php

					<!-- Multiple column menu example -->
					<?php
					$navbarModel = new \App\Models\Backend\NavbarModel();
					$parentNavItems = $navbarModel->where('navbar_parent_id', 0)->findAll();
---
SELECT *
FROM `tbl_navbar`
WHERE `navbar_parent_id` = 0

						<?php foreach ($parentNavItems as $row): ?>
							<?php
							$nav_id = $row['navbar_id'];
							$subNavItems = $navbarModel->where('navbar_parent_id', $nav_id)->findAll();
---
SELECT *
FROM `tbl_navbar`
WHERE `navbar_parent_id` = '1'